## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 10 to add, 1 to change, 4 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudfront_distribution.scan_files_api will be created
  + resource "aws_cloudfront_distribution" "scan_files_api" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true
      + web_acl_id                     = "ca5274a3-f27b-4562-a21e-5cd0c8c17835"

      + default_cache_behavior {
          + allowed_methods            = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = false
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "scan-files-api"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + logging_config {
          + bucket          = "scan-files-production-logs.s3.amazonaws.com"
          + include_cookies = false
          + prefix          = "cloudfront"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "ryafv4e4l4i4e4lrq5zi7jyneq0odcsr.lambda-url.ca-central-1.on.aws"
          + origin_id           = "scan-files-api"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:ca-central-1:806545929748:certificate/75f2e70b-e103-45f2-b7d5-3d3b1930f6e0"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_response_headers_policy.security_headers_policy_api will be created
  + resource "aws_cloudfront_response_headers_policy" "security_headers_policy_api" {
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "scan-files-security-headers-api"

      + security_headers_config {
          + content_security_policy {
              + content_security_policy = "default-src 'none'; script-src 'self'; connect-src 'self'; img-src 'self'; style-src 'self'; frame-ancestors 'self'; form-action 'self';"
              + override                = true
            }

          + content_type_options {
              + override = true
            }

          + frame_options {
              + frame_option = "DENY"
              + override     = true
            }

          + referrer_policy {
              + override        = true
              + referrer_policy = "same-origin"
            }

          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + include_subdomains         = true
              + override                   = true
              + preload                    = true
            }

          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

  # aws_network_acl_rule.ephemeral_ports will be destroyed
  - resource "aws_network_acl_rule" "ephemeral_ports" {
      - cidr_block     = "0.0.0.0/0" -> null
      - egress         = false -> null
      - from_port      = 1024 -> null
      - id             = "nacl-3874926043" -> null
      - network_acl_id = "acl-0e28f693339e2a2a0" -> null
      - protocol       = "6" -> null
      - rule_action    = "allow" -> null
      - rule_number    = 101 -> null
      - to_port        = 65535 -> null
    }

  # aws_network_acl_rule.ephemeral_ports_egress will be destroyed
  - resource "aws_network_acl_rule" "ephemeral_ports_egress" {
      - cidr_block     = "0.0.0.0/0" -> null
      - egress         = true -> null
      - from_port      = 1024 -> null
      - id             = "nacl-2122990702" -> null
      - network_acl_id = "acl-0e28f693339e2a2a0" -> null
      - protocol       = "6" -> null
      - rule_action    = "allow" -> null
      - rule_number    = 101 -> null
      - to_port        = 65535 -> null
    }

  # aws_network_acl_rule.https will be destroyed
  - resource "aws_network_acl_rule" "https" {
      - cidr_block     = "0.0.0.0/0" -> null
      - egress         = false -> null
      - from_port      = 443 -> null
      - id             = "nacl-2102649268" -> null
      - network_acl_id = "acl-0e28f693339e2a2a0" -> null
      - protocol       = "6" -> null
      - rule_action    = "allow" -> null
      - rule_number    = 100 -> null
      - to_port        = 443 -> null
    }

  # aws_network_acl_rule.https_egress will be destroyed
  - resource "aws_network_acl_rule" "https_egress" {
      - cidr_block     = "0.0.0.0/0" -> null
      - egress         = true -> null
      - from_port      = 443 -> null
      - id             = "nacl-3204750254" -> null
      - network_acl_id = "acl-0e28f693339e2a2a0" -> null
      - protocol       = "6" -> null
      - rule_action    = "allow" -> null
      - rule_number    = 100 -> null
      - to_port        = 443 -> null
    }

  # aws_route53_record.scan_files_A will be updated in-place
  ~ resource "aws_route53_record" "scan_files_A" {
        id      = "Z09208862AM3U6FRXOHM8_scan-files.alpha.canada.ca_A"
        name    = "scan-files.alpha.canada.ca"
        # (5 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d-dt1p5coyo6.execute-api.ca-central-1.amazonaws.com" -> null
          - zone_id                = "Z19DQILCV0OWEC" -> null
        }
      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.vpc.aws_network_acl_rule.https_request_egress_443[0] will be created
  + resource "aws_network_acl_rule" "https_request_egress_443" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = "acl-0e28f693339e2a2a0"
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 60
      + to_port        = 443
    }

  # module.vpc.aws_network_acl_rule.https_request_in_ingress_443[0] will be created
  + resource "aws_network_acl_rule" "https_request_in_ingress_443" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = "acl-0e28f693339e2a2a0"
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 70
      + to_port        = 443
    }

  # module.vpc.aws_network_acl_rule.https_request_in_ingress_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "https_request_in_ingress_ephemeral" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = "acl-0e28f693339e2a2a0"
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 71
      + to_port        = 65535
    }

  # module.vpc.aws_network_acl_rule.https_request_in_response_egress_443[0] will be created
  + resource "aws_network_acl_rule" "https_request_in_response_egress_443" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = true
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = "acl-0e28f693339e2a2a0"
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 72
      + to_port        = 443
    }

  # module.vpc.aws_network_acl_rule.https_request_in_response_egress_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "https_request_in_response_egress_ephemeral" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = "acl-0e28f693339e2a2a0"
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 73
      + to_port        = 65535
    }

  # module.vpc.aws_network_acl_rule.https_request_out_egress_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "https_request_out_egress_ephemeral" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = true
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = "acl-0e28f693339e2a2a0"
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 61
      + to_port        = 65535
    }

  # module.vpc.aws_network_acl_rule.https_request_out_response_ingress_443[0] will be created
  + resource "aws_network_acl_rule" "https_request_out_response_ingress_443" {
      + cidr_block     = "10.0.0.0/16"
      + egress         = false
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = "acl-0e28f693339e2a2a0"
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 62
      + to_port        = 443
    }

  # module.vpc.aws_network_acl_rule.https_request_out_response_ingress_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "https_request_out_response_ingress_ephemeral" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = "acl-0e28f693339e2a2a0"
      + protocol       = "tcp"
      + rule_action    = "allow"
      + rule_number    = 63
      + to_port        = 65535
    }

Plan: 10 to add, 1 to change, 4 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the top-level parameter object_lock_enabled and the
aws_s3_bucket_object_lock_configuration resource instead

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
